src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидыЦен</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	УчетПоСериям = ПолучитьФункциональнуюОпцию("УчётПоСериям", );
	
	Если НЕ УчетПоСериям Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = ЭтотОбъект.Товары.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ 
	|	Номенклатура.Ссылка в(&МассивНоменклатуры)";
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	ВидНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрока из Товары Цикл
		НайденнаяСтрока = ВидНоменклатуры.Найти(ТекСтрока.Номенклатура);
		Если (НайденнаяСтрока.ВидНоменклатуры  =  Перечисления.ВидыНоменклатуры.Товар) И
		  НЕ ЗначениеЗаполнено(ТекСтрока.Серия) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("В строке %1 табличной части 'Товары' не заполнена серия для номенклатуры '%2'.",
                        ТекСтрока.НомерСтроки, ТекСтрока.Номенклатура);
                        	Сообщение.УстановитьДанные(ЭтотОбъект);
                        	Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Серия"));
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента=Товары.Итог("Сумма") + Товары.Итог("Сумма");
КонецПроцедуры
